flyghost/OneOS-V2.1.0/templates/fm33-common/replace/FM33G0/board/bsp_config/Inc/iar/FM33G0XX.h
#define GPIOA_BASE  				(PERIPH_BASE				+0x00000C00)
#define GPIOB_BASE					(PERIPH_BASE				+0x00000C20)
#define GPIOC_BASE					(PERIPH_BASE				+0x00000C40)
#define GPIOD_BASE  				(PERIPH_BASE				+0x00000C60)
#define GPIOE_BASE					(PERIPH_BASE				+0x00000C80)
#define GPIOF_BASE					(PERIPH_BASE				+0x00000CA0)
#define GPIOG_BASE					(PERIPH_BASE				+0x00000CC0)
#define GPIO_COMMON_BASE			(PERIPH_BASE				+0x00000CE0)

#define NVMIF_BASE					(PERIPH_BASE				+0x00001000)

#define CRC_BASE					(PERIPH_BASE				+0x00010000)	

#define CRC_BASE					(PERIPH_BASE				+0x00010000)	

#define LPUART_BASE				(PERIPH_BASE				+0x00010400)

#define DISP_BASE					(PERIPH_BASE				+0x00010C00)	

#define RTC_BASE					(PERIPH_BASE				+0x00011000)

#define IWDT_BASE					(PERIPH_BASE				+0x00011400)	

#define WWDT_BASE					(PERIPH_BASE				+0x00011800)

#define U78160_BASE					(PERIPH_BASE				+0x00011C00)	
#define U78161_BASE					(PERIPH_BASE				+0x00011C2C)	

#define UART_COMMON_BASE			(PERIPH_BASE				+0x00012000)
#define UART0_BASE					(PERIPH_BASE				+0x0001200C)	
#define UART1_BASE					(PERIPH_BASE				+0x0001202C)	
#define UART2_BASE					(PERIPH_BASE				+0x0001204C)	
#define UART3_BASE					(PERIPH_BASE				+0x0001206C)	
#define UART4_BASE					(PERIPH_BASE				+0x0001208C)	
#define UART5_BASE					(PERIPH_BASE				+0x000120AC)	

#define I2C_BASE					(PERIPH_BASE				+0x00012400)

#define ANAC_BASE					(PERIPH_BASE				+0x00012800)

#define RAMBIST_BASE				(PERIPH_BASE				+0x00012C00)

#define BTIMER1_BASE				(PERIPH_BASE				+0x00013000)
#define BTIMER2_BASE				(PERIPH_BASE				+0x00013044)

#define ETIMER1_BASE				(PERIPH_BASE				+0x00013090)
#define ETIMER2_BASE				(PERIPH_BASE				+0x000130B0)
#define ETIMER3_BASE				(PERIPH_BASE				+0x000130D0)
#define ETIMER4_BASE				(PERIPH_BASE				+0x000130F0)
#define ETCNT_BASE				  (PERIPH_BASE				+0x00013110)

#define LPTIM_BASE					(PERIPH_BASE				+0x00013400)

#define AES_BASE					(PERIPH_BASE				+0x00013800)

#define TRNG_BASE					(PERIPH_BASE				+0x00013C00)

/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */
#define SCU							((SCU_Type             		*) SCU_BASE					)
#define PMU							((PMU_Type             		*) PMU_BASE					)
#define RCC							((RCC_Type             		*) RCC_BASE					)
#define DMA							((DMA_Type             		*) DMA_BASE					)

#define HSPI							((SPIx_Type            		*) HSPI_BASE				)
#define SPI1							((SPIx_Type            		*) SPI1_BASE				)
#define SPI2							((SPIx_Type            		*) SPI2_BASE				)

#define NVMIF							((NVMIF_Type           		*) NVMIF_BASE				)
#define FLASH							((NVMIF_Type           		*) NVMIF_BASE				)
#define UART							((UART_common_Type        *) UART_COMMON_BASE	)
#define UART0							((UARTx_Type              *) UART0_BASE				)
#define UART1							((UARTx_Type              *) UART1_BASE				)
#define UART2							((UARTx_Type              *) UART2_BASE				)
#define UART3							((UARTx_Type              *) UART3_BASE				)
#define UART4							((UARTx_Type              *) UART4_BASE				)
#define UART5							((UARTx_Type              *) UART5_BASE				)
#define LPUART						((LPUART_Type       			*) LPUART_BASE			)
#define IWDT							((IWDT_Type               *) IWDT_BASE				)

#define GPIOA							((GPIOx_Type         			*) GPIOA_BASE				)
#define GPIOB							((GPIOx_Type         			*) GPIOB_BASE				)
#define GPIOC							((GPIOx_Type         			*) GPIOC_BASE				)
#define GPIOD							((GPIOx_Type         			*) GPIOD_BASE				)
#define GPIOE							((GPIOx_Type         			*) GPIOE_BASE				)
#define GPIOF							((GPIOx_Type         			*) GPIOF_BASE				)
#define GPIOG							((GPIOx_Type         			*) GPIOG_BASE				)
#define GPIO							((GPIO_COMMON_Type   			*) GPIO_COMMON_BASE	)

#define RAMBIST							((RAMBIST_Type   				*) RAMBIST_BASE			)

#define BTIM1							((BTIMx_Type         		*) BTIMER1_BASE			)
#define BTIM2							((BTIMx_Type         		*) BTIMER2_BASE			)

#define ETIM1							((ETIMx_Type         		*) ETIMER1_BASE			)
#define ETIM2							((ETIMx_Type         		*) ETIMER2_BASE			)
#define ETIM3							((ETIMx_Type         		*) ETIMER3_BASE			)
#define ETIM4							((ETIMx_Type         		*) ETIMER4_BASE			)
#define ETCNT							((ETCNT_Type         		*) ETCNT_BASE			)

#define LPTIM							((LPTIM_Type         			*) LPTIM_BASE				)
#define ANAC							((ANAC_Type        				*) ANAC_BASE				)
#define WWDT							((WWDT_Type						*) WWDT_BASE				)

#define I2C								((I2C_Type         				*) I2C_BASE					)
#define CRC								((CRC_Type        				*) CRC_BASE					)
#define LCD								((DISP_Type        				*) DISP_BASE				)
#define RTC								((RTC_Type        				*) RTC_BASE					)
#define U78160							((U7816x_Type        			*) U78160_BASE				)
#define U78161							((U7816x_Type        			*) U78161_BASE				)

#define AES								((AES_Type        				*) AES_BASE					)
#define TRNG							((TRNG_Type        				*) TRNG_BASE				)

/* ================================================================================ */
/* ================             Peripheral include                 ================ */
/* ================================================================================ */

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33G0XX */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif


#endif  /* FM33G0XX_H */

